app/controllers/hotels_controller.rb

  def rate
    score = params[:rating].to_i
    hotel_id = params[:hotel_id]
    user_id = 1
    @rating = Rating.new do |r|
      r.score = score
      r.hotel_id = hotel_id
      r.user_id = user_id
    end
    user_id_from_rating = user_id
    hotel_id_from_rating = hotel_id
    Rating.where("user_id = " + user_id.to_s + " AND hotel_id = " + hotel_id.to_s).destroy_all
    if @rating.save
      all_ratings = Rating.all
      all_hotels = Hotel.all
      loop_size = all_hotels.size
      loop_size -= 1
      if loop_size > -1
        hotel_ratings = Array.new(loop_size * 3)
        for i in 0..loop_size
          hotel_ratings[(i*3)] = all_hotels[i].id
          hotel_ratings[(i*3)+1] = 0
          hotel_ratings[(i*3)+2] = 0
        end
        loop_size_rating = all_ratings.size
---
SELECT "ratings".* FROM "ratings"
SELECT "hotels".* FROM "hotels"
SELECT COUNT(*) FROM "hotels"
SELECT COUNT(*) FROM "ratings"

        for i in 0..loop_size
          hotel = Hotel.find(hotel_ratings[i*3])
          hotel.rate = hotel_ratings[(i*3)+1]
          hotel.save
---
UPDATE "hotels" SET "rate" = ?, "updated_at" = ? WHERE "hotels"."id" = 2  [["rate", 5], ["updated_at", Sun, 09 Feb 2014 22:27:01 UTC +00:00]]