app/controllers/hotels_controller.rb

SELECT "hotels".* FROM "hotels" ORDER BY rate DESC LIMIT 5
---
  def top
    @hotels_top_arr = Hotel.all(:order => "rate DESC", :limit => 5)

SELECT "hotels".* FROM "hotels" ORDER BY rate DESC
---
  def all
    @hotels_all_arr = Hotel.all(:order => "rate DESC")

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", "2"]]
---
  def see
    @hotel_for_rate = Hotel.find(params[:id])

DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 1]]
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ratings".* FROM "ratings" WHERE (user_id = user_id_from_rating AND hotel_id = hotel_id_from_rating)
INSERT INTO "ratings" ("created_at", "hotel_id", "score", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 09 Feb 2014 22:17:52 UTC +00:00], ["hotel_id", 2], ["score", 5], ["updated_at", Sun, 09 Feb 2014 22:17:52 UTC +00:00], ["user_id", 1]]
---
  def rate
    score = params[:rating].to_i
    hotel_id = params[:hotel_id]
    user_id = 1
    @rating = Rating.new do |r|
      r.score = score
      r.hotel_id = hotel_id
      r.user_id = user_id
    end
    Rating.where("user_id = " + user_id.to_s + " AND hotel_id = " + hotel_id.to_s).destroy_all
    if @rating.save

INSERT INTO "hotels" ("address", "breakfast", "created_at", "description", "photoUrl", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @hotel = Hotel.new(hotel_params)
    respond_to do |format|
      if @hotel.save

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", "top"]]
---
    def set_hotel
      @hotel = Hotel.find(params[:id])