app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "login", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 08 Feb 2014 17:58:35 UTC +00:00], ["login", "asd"], ["password", "asdaasada"], ["updated_at", Sat, 08 Feb 2014 17:58:35 UTC +00:00]]