app/controllers/welcome_controller.rb

  def index
    puts "<---------------DEBUG---ENTRY---BEGINS--------------->"
    puts "<-------restore---session---data--------------------->"
    @old_user = User.find(:all, :conditions => { :login => [cookies[:login]] })
---
SELECT "users".* FROM "users" WHERE "users"."login" IS NULL

  def login
    @user = User.find(:all, :conditions => { :login => [params[:login]] })
    @debug_msg = ""
    @token = ""
    if @user.blank?
      @debug_msg = "user login doesn't exist"
    end
    if !@debug_msg.blank?
      return @debug_msg
    end
    if @user[0].login == params[:login] && @user[0].password == params[:password]
      token = SecureRandom.hex
      Token.destroy_all(:user_id => @user[0].id)
      @new_token = Token.new
      @new_token.token = token
      @new_token.user_id = @user[0].id
      @new_token.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "Log In"]]
DELETE FROM "tokens" WHERE "tokens"."id" = ?  [["id", 1]]
INSERT INTO "tokens" ("created_at", "token", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 09 Feb 2014 12:45:17 UTC +00:00], ["token", "6a8a4939fcd8e8746d13744ad6b13377"], ["updated_at", Sun, 09 Feb 2014 12:45:17 UTC +00:00], ["user_id", 3]]